var insertSql =
"INSERT INTO `small_categories` (`id`, `middle_category_id`, `name`) " +
"VALUES " +
    "(1, 1, '硬質プラスチック破片'), " +
    "(2, 1, 'プラスチックシートや袋の破片'), " +
    "(3, 1, '発泡スチロール破片：小（1cm2未満）'), " +
    "(4, 1, '発泡スチロール破片：大（1cm2以上）'), " +
    "(5, 1, 'ガラスや陶器の破片'), " +
    "(6, 1, '紙片'), " +
    "(7, 1, '金属破片'), " +
    "(8, 2, 'タバコの吸殻・フィルター'), " +
    "(9, 2, 'タバコのパッケージ・包装'), " +
    "(10, 2, '葉巻などの吸い口'), " +
    "(11, 2, '使い捨てライター'), " +
    "(12, 3, 'ペットボトル'), " +
    "(13, 3, '飲料ガラスびん'), " +
    "(14, 3, '飲料缶'), " +
    "(15, 3, 'ふた・キャップ'), " +
    "(16, 3, 'プルタブ'), " +
    "(17, 3, '６パックホルダー'), " +
    "(18, 4, '食器（わりばし含む）'), " +
    "(19, 4, 'ストロー・マドラー'), " +
    "(20, 4, '食品の包装・容器'), " +
    "(21, 4, '袋類（農業用以外）'), " +
    "(22, 5, '農薬・肥料袋'), " +
    "(23, 5, 'シート類（レジャー用など）'), " +
    "(24, 5, '苗木ポット'), " +
    "(25, 6, '注射器'), " +
    "(26, 6, '注射器以外の医療ゴミ'), " +
    "(27, 6, 'コンドーム'), " +
    "(28, 6, 'タンポンのアプリケーター'), " +
    "(29, 6, '紙おむつ'), " +
    "(30, 7, '漂白剤・洗剤類ボトル'), " +
    "(31, 7, 'スプレー缶・カセットボンベ'), " +
    "(32, 7, '生活雑貨'), " +
    "(33, 7, 'おもちゃ'), " +
    "(34, 7, '風船'), " +
    "(35, 7, '花火'), " +
    "(36, 8, '衣服類'), " +
    "(37, 8, 'くつ・サンダル'), " +
    "(38, 9, '家電製品・家具'), " +
    "(39, 9, '電池（バッテリーも含む）'), " +
    "(40, 9, '自転車・バイク'), " +
    "(41, 9, 'タイヤ'), " +
    "(42, 9, '自動車・部品'), " +
    "(43, 9, '潤滑油缶・ボトル'), " +
    "(44, 10, '梱包用木箱'), " +
    "(45, 10, '物流用パレット'), " +
    "(46, 10, '荷造り用ストラップバンド'), " +
    "(47, 10, 'ドラム缶'), " +
    "(48, 11, 'くぎ・針金'), " +
    "(49, 11, '建築資材（くぎ・針金以外）'), " +
    "(50, 12, '薬きょう（猟銃の弾丸の殻）'), " +
    "(51, 12, 'レンジペレット'), " +
    "(52, 13, '釣り糸'), " +
    "(53, 13, 'ロープ・ひも'), " +
    "(54, 13, '漁網'), " +
    "(55, 13, '発泡スチロール製フロート'), " +
    "(56, 13, 'ウキ・フロート・ブイ'), " +
    "(57, 13, 'かご漁具'), " +
    "(58, 13, '魚箱（トロ箱）'), " +
    "(59, 13, '釣りえさ袋・容器'), " +
    "(60, 13, '電球・蛍光灯（家庭用も含む）'), " +
    "(61, 13, 'ルアー・蛍光棒（ケミホタル）'), " +
    "(62, 13, 'カキ養殖用パイプ'), " +
    "(63, 13, '廃油ボール'), " +
    /*
    "(64, 1, '破片/かけら類(小分類なし)'), " +
    "(65, 2, 'タバコ(小分類なし)'), " +
    "(66, 3, '飲料(小分類なし)'), " +
    "(67, 4, '食品(小分類なし)'), " +
    "(68, 5, '農業(小分類なし)'), " +
    "(69, 6, '医療・衛生(小分類なし)'), " +
    "(70, 7, '生活・レクリエーション(小分類なし)'), " +
    "(71, 8, '衣料品(小分類なし)'), " +
    "(72, 9, '大型粗大ゴミ(小分類なし)'), " +
    "(73, 10, '物流(小分類なし)'), " +
    "(74, 11, '建築(小分類なし)'), " +
    "(75, 12, '特殊(小分類なし)'), " +
    "(76, 13, '海・河川・湖沼(小分類なし)'), " +
    */
    "(77, 14, 'その他'); ";

migration.up = function(migrator) {
    migrator.createTable({
        columns: {
            "id": "integer",
            "middle_category_id": "integer",
            "name": "text"
        },
    });

    migrator.db.execute(insertSql);
};

migration.down = function(migrator) {
    migrator.dropTable();
};
